dish(1,пицца маргарита,_18482,основное блюдо,[1035,1058,1010,1068],_18488).
dish(2,паста болоньезе,_18482,основное блюдо,[21,26,1058,1071],_18488).
dish(3,борщ,украинская кухня,суп,[1003,1008,1001,1045,1075],_18488).
dish(4,минестроне,итальянская кухня,суп,[1002,1072,1073,1079,21],_18488).
dish(5,сальса,мексиканская кухня,соус,[1010,1004,1065],_18488).
dish(6,ямайский пирог,ямайская кухня,выпечка,[1030,1060,1046,1074,1078,1076],_18488).
dish(7,ямайское рагу,ямайская кухня,основное блюдо,[1045,1001,1002,1012,1010,1013,1075,1005,1073],выпекание).
dish(8,гуакамоле,мексиканская кухня,соус,[1015,1019,1004,1010,1076],_18488).
dish(9,тако,мексиканская кухня,закуска,[24,1045,1058,1007,5],сборка).
dish(10,курица карри,индийская кухня,основное блюдо,[1036,1012,1054,1066,1004],тушение).
dish(11,наан,индийская кухня,закуска,[1030,1061,1067,1060],выпекание).
dish(12,роллы,японская кухня,закуска,[1028,1064,1039],сборка).
dish(13,суши,японская кухня,закуска,[1028,1039,1064,1055],сборка).
dish(14,утка по-пекински,китайская кухня,основное блюдо,[1037,1077,1056,23],жарка).
dish(15,жасминовый рис,азиатская кухня,гарнир,[1031,1050],варка).
dish(16,тапас,испанская кухня,закуска,[27,1052,1005,1085],гриль).
dish(17,паэлья,испанская кухня,основное блюдо,[1028,1057,1042,1012,1005,1065,26,1036],тушение).
dish(18,рататуй,французская кухня,основное блюдо,[1013,1014,1010,1004,1005],тушение).
dish(19,круассан,французская кухня,выпечка,[1030,1060,1067,1048],_18488).
dish(20,паста карбонара,итальянская кухня,основное блюдо,[21,1070,1058,1080],варка).
dish(21,паста,общее,основное блюдо,[1030,1083,1080,1050],варка).
dish(22,бульон,общее,суп,[1083,1045,1075,1004,1002,1084,1050,1082],варка).
dish(23,пицца пепперони,итальянская кухня,основное блюдо,[1035,1058,1010,1069],выпекание).
dish(24,блины,общее,основное блюдо,[1030,1059,1080,1048,1050,1081],жарка).
dish(25,тортилья,мексиканская кухня,закуска,[1030,1083,1050],жарка).
dish(26,томатный соус,общее,соус,[1010,1004,1005,1052,1050,1082,1068,1048],_18488).
dish(27,хлеб,общее,выпечка,[1030,1083,1067,1048,1050,1081],_18488).
dish(28,окрошка,русская кухня,суп,[1001,1011,1086,1087,1088],смешивание).
dish(29,греческий салат,греческая кухня,салат,[1052,1012,1010,1090,1091,1011],_18488).
dish(30,пшеничный хлеб с отрубями,_18482,_18484,[1092],_18488).
ingredient(1001,картофель,овощи).
ingredient(1002,морковь,овощи).
ingredient(1003,свёкла,овощи).
ingredient(1004,репчатый лук,овощи).
ingredient(1005,чеснок,овощи).
ingredient(1006,шпинат,овощи).
ingredient(1007,салат листовой,овощи).
ingredient(1008,белокочаная капуста,овощи).
ingredient(1009,лук порей,овощи).
ingredient(1010,томат,овощи).
ingredient(1011,огурец,овощи).
ingredient(1012,болгарский перец,овощи).
ingredient(1013,баклажан,овощи).
ingredient(1014,кабачок,овощи).
ingredient(1015,авокадо,овощи).
ingredient(1065,кинза,зелень).
ingredient(1068,базилик,зелень).
ingredient(1079,бобы,овощи).
ingredient(1084,сельдерей,зелень).
ingredient(1086,редис,овощи).
ingredient(1091,оливки,овощи).
ingredient(1016,апельсин,фрукты).
ingredient(1017,лимон,фрукты).
ingredient(1018,грейпфрут,фрукты).
ingredient(1019,лайм,фрукты).
ingredient(1020,клубника,ягоды).
ingredient(1021,малина,ягоды).
ingredient(1022,голубика,ягоды).
ingredient(1023,банан,фрукты).
ingredient(1024,манго,фрукты).
ingredient(1025,ананас,фрукты).
ingredient(1027,пшеница,зерновые).
ingredient(1028,рис,зерновые).
ingredient(1029,кукуруза,зерновые).
ingredient(1030,мука,зерновые).
ingredient(1031,жасминовый рис,зерновые).
ingredient(1032,гречка,крупы).
ingredient(1033,овсянка,крупы).
ingredient(1034,киноа,крупы).
ingredient(1035,тесто,злаки).
ingredient(1036,курица,птица).
ingredient(1037,утка,птица).
ingredient(1038,индейка,птица).
ingredient(1039,лосось,рыба).
ingredient(1040,тунец,рыба).
ingredient(1041,треска,рыба).
ingredient(1042,мидии,морепродукты).
ingredient(1043,устрицы,морепродукты).
ingredient(1044,кальмары,морепродукты).
ingredient(1064,водоросли нори,морепродукты).
ingredient(1045,говядина,мясо).
ingredient(1046,свинина,мясо).
ingredient(1047,баранина,мясо).
ingredient(1069,пепперони,мясо).
ingredient(1070,бекон,мясо).
ingredient(1071,фарш,мясо).
ingredient(1085,ветчина,мясо).
ingredient(1088,докторская колбаса,мясо).
ingredient(1048,сахар,приправы).
ingredient(1049,специи,приправы).
ingredient(1050,соль,приправы).
ingredient(1051,перец,приправы).
ingredient(1052,оливковое масло,растительные продукты).
ingredient(1053,сальса,приправы).
ingredient(1054,специи карри,приправы).
ingredient(1055,васаби,приправы).
ingredient(1056,соус хойсин,приправы).
ingredient(1057,шафран,приправы).
ingredient(1072,розмарин,приправы).
ingredient(1073,тимьян,приправы).
ingredient(1074,кориандр,приправы).
ingredient(1075,лавровый лист,приправы).
ingredient(1076,перец чили,приправы).
ingredient(1077,корица,приправы).
ingredient(1078,мускатный орех,приправы).
ingredient(1082,черный перец,приправы).
ingredient(1058,сыр,молочные продукты).
ingredient(1059,молоко,молочные продукты).
ingredient(1060,сливочное масло,молочные продукты).
ingredient(1061,йогурт,молочные продукты).
ingredient(1062,сливки,молочные продукты).
ingredient(1063,творог,молочные продукты).
ingredient(1087,кефир,молочные продукты).
ingredient(1090,сыр фета,молочные продукты).
ingredient(1066,кокосовое молоко,растительные продукты).
ingredient(1067,дрожжи,растительные продукты).
ingredient(1081,растительное масло,растительные продукты).
ingredient(1080,куриное яйцо,яйца).
ingredient(1083,вода,жидкость).
ingredient(1089,закваска,зерновые).
ingredient(1092,отруби,злаковые).
